import { categories } from '@/data/categories/categories'
import { CategoriesGrid } from './_components'

const CategoriesPage = () => {
  console.log('Categores page')

  return (
    <main>
      <div className="container">
        <h1 className="my-5 text-4xl font-semibold">Категории</h1>
        <CategoriesGrid categories={categories} />
      </div>
    </main>
  )
}

export default CategoriesPage

//   const categories = [
//     {
//       id: 1,
//       name: 'Электроника',
//       subCategories: [
//         {
//           name: 'Смартфоны и телефоны',
//           items: [
//             'Смартфоны',
//             'Аксессуары для смартфонов',
//             'Мобильные телефоны',
//             'Гарнитуры и наушники'
//           ]
//         },
//         {
//           name: 'Ноутбуки, планшеты и электронные книги',
//           items: [
//             'Ноутбуки',
//             'Планшеты',
//             'Электронные книги',
//             'Аксессуары для ноутбуков'
//           ]
//         },
//         {
//           name: 'Компьютерная техника',
//           items: [
//             'Компьютеры',
//             'Комплектующие',
//             'Периферия',
//             'Сетевое оборудование'
//           ]
//         }
//       ],
//       itemCount: 15250,
//       image:
//         'https://public.readdy.ai/ai/img_res/f4c0aab810b419eebbc808eb03fcc856.jpg'
//     },
//     {
//       id: 2,
//       name: 'Бытовая техника',
//       subCategories: [
//         {
//           name: 'Техника для кухни',
//           items: [
//             'Холодильники',
//             'Посудомоечные машины',
//             'Плиты и духовки',
//             'Микроволновые печи'
//           ]
//         },
//         {
//           name: 'Техника для дома',
//           items: ['Стиральные машины', 'Пылесосы', 'Утюги', 'Швейные машины']
//         },
//         {
//           name: 'Климатическая техника',
//           items: [
//             'Кондиционеры',
//             'Вентиляторы',
//             'Обогреватели',
//             'Очистители воздуха'
//           ]
//         }
//       ],
//       itemCount: 8340,
//       image:
//         'https://public.readdy.ai/ai/img_res/4ecd586ec0404349619cf915028cc658.jpg'
//     },
//     {
//       id: 3,
//       name: 'ТВ, аудио и фото',
//       subCategories: [
//         {
//           name: 'Телевизоры и аксессуары',
//           items: [
//             'Телевизоры',
//             'Кронштейны',
//             'ТВ-приставки',
//             'Домашние кинотеатры'
//           ]
//         },
//         {
//           name: 'Аудиотехника',
//           items: [
//             'Акустические системы',
//             'Наушники',
//             'Музыкальные центры',
//             'Саундбары'
//           ]
//         },
//         {
//           name: 'Фото и видеотехника',
//           items: ['Фотоаппараты', 'Видеокамеры', 'Объективы', 'Экшн-камеры']
//         }
//       ],
//       itemCount: 6820,
//       image:
//         'https://public.readdy.ai/ai/img_res/e0ed8b8d1ee74228fea4feee337801f7.jpg'
//     },
//     {
//       id: 4,
//       name: 'Игры и консоли',
//       subCategories: [
//         {
//           name: 'Игровые консоли',
//           items: [
//             'PlayStation',
//             'Xbox',
//             'Nintendo Switch',
//             'Аксессуары для консолей'
//           ]
//         },
//         {
//           name: 'Компьютерные игры',
//           items: [
//             'Игры для PC',
//             'Игры для PlayStation',
//             'Игры для Xbox',
//             'Коллекционные издания'
//           ]
//         },
//         {
//           name: 'Игровые аксессуары',
//           items: ['Геймпады', 'Игровые гарнитуры', 'Рули', 'Джойстики']
//         }
//       ],
//       itemCount: 4980,
//       image:
//         'https://public.readdy.ai/ai/img_res/a056e777511293e2a428a13e5f352397.jpg'
//     },
//     {
//       id: 5,
//       name: 'Офисная техника',
//       subCategories: [
//         {
//           name: 'Принтеры и МФУ',
//           items: [
//             'Лазерные принтеры',
//             'Струйные принтеры',
//             'МФУ',
//             'Расходные материалы'
//           ]
//         },
//         {
//           name: 'Оргтехника',
//           items: ['Сканеры', 'Факсы', 'Телефоны', 'Калькуляторы']
//         },
//         {
//           name: 'Компьютерные аксессуары',
//           items: ['Клавиатуры', 'Мыши', 'Веб-камеры', 'USB-хабы']
//         }
//       ],
//       itemCount: 3560,
//       image:
//         'https://public.readdy.ai/ai/img_res/8e09cfb2193ff9b488498dde205c8e0f.jpg'
//     },
//     {
//       id: 6,
//       name: 'Автоэлектроника',
//       subCategories: [
//         {
//           name: 'Автомобильные гаджеты',
//           items: [
//             'Видеорегистраторы',
//             'GPS-навигаторы',
//             'Радар-детекторы',
//             'Парктроники'
//           ]
//         },
//         {
//           name: 'Автозвук',
//           items: ['Магнитолы', 'Акустика', 'Усилители', 'Сабвуферы']
//         },
//         {
//           name: 'Автобезопасность',
//           items: ['Сигнализации', 'Иммобилайзеры', 'Замки', 'Датчики']
//         }
//       ],
//       itemCount: 5340,
//       image:
//         'https://public.readdy.ai/ai/img_res/488433605aafd8e39c1cf93e4bfb01ae.jpg'
//     }
//   ]
